%%问题一主成分分析法的程序
%R为影响因素的相关系数矩阵
R=[1 -0.305 0.995 -0.194 0.991;-0.305 1 -0.396 -0.875 -0.429;0.995 -0.396 1 -0.098 0.999;-0.194 -0.875 -0.098 1 -0.062;0.991 -0.429 0.999 -0.062 1];
[COEFF,latent,explained]=pcacov(R) 
%为了更加直观，以元胞数组形式显示结果
result1(1,:)={'特征值','差值','贡献率','累积贡献率'};
result1(2:6,1)=num2cell(latent);
result1(2:5,2)=num2cell(-diff(latent));
result1(2:6,3:4)=num2cell([explained,cumsum(explained)])
%以元胞数组形式显示前三个主成分表达式
s={'标准化变量';'x1：出险次数';'x2：车辆年龄';'x3：使用性质';'x4：承保渠道';'x5：购买价格'};
result2(:,1)=s;
result2(1,2:3)={'prin1','prin2'};
result2(2:6,2:3)=num2cell(COEFF(:,1:2))