% m_compet.m

%% 清理
clear,clc
close all

%% 样本数据
x0=[4.1,1.8,0.5,2.9,4.0,0.6,3.8,4.3,3.2,1.0,3.0,3.6,3.8,3.7,3.7,8.6,9.1,...
    7.5,8.1,9.0,6.9,8.6,8.5,9.6,10.0,9.3,6.9,6.4,6.7,8.7;...
    8.1,5.8,8.0,5.2,7.1,7.3,8.1,6.0,7.2,8.3,7.4,7.8,7.0,6.4,8.0,...
    3.5,2.9,3.8,3.9,2.6,4.0,2.9,3.2,4.9,3.5,3.3,5.5,5.0,4.4,4.3];

%% 建立竞争网络，两个类别
net = competlayer(2);

%% 训练
net.trainParam.epochs=400;
tic
net=train(net,x0);
toc

%% 计算结果
y=net(x0);
calsses = vec2ind(y);
fprintf('分类结果\n');
disp(calsses)
view(net)

