%%  利用方差分析进行同一横断面交通事故所占车道不同对该横断面实际通行能力影响的差异的分析

data1=[16	2	4
18	1	1
16	1	0
19	0	1
14	3	0
17	2	1
20	3	0
14	2	1
18	4	0
12	2	1
13	2	1
15	2	1
13	3	0
14	2	0
14	3	2
]; 
data2=[18	1	2
19	2	2
16	2	1
16	2	3
19	0	1
14	0	3
17	1	2
20	0	1
21	2	2
15	1	1
20	1	1
12	0	1
13	1	4
17	1	1
22	1	1
17	2	1
18	3	0
16	1	1
16	1	1
17	0	2
19	1	1
15	2	3
17	0	3
16	0	2
10	1	3
15	2	2
17	0	2
17	1	1
18	1	2
];
data1=data1(:,1)+1.5*data1(:,2)+data1(:,3)*2;
data2=data2(:,1)+1.5*data2(:,2)+data2(:,3)*2;
% 将视频1和视频2事故横断面交通流量转化成标准当量

%% 进行方差分析
x=[data1*60;data2*60]; 
x=x';
g=[ones(1,15),2*ones(1,29)]; 
p=anova1(x,g)    